## Exercises: 14. Data Frames

#### Problem 1

Use the [DataFrame](https://dataframes.juliadata.org/stable/) below and apply the following operations:

In [64]:
using DataFrames, Statistics

data = Dict("Name" => ["Alice", "Bob", "Charlie", "David", "Emma", "Fiona"], 
            "Age" => [20, 30, 25, 19, 30, 28],
            "Height" => [175, 188, 182, 192, 172, 168],
            "Weight" => [72, 80, 85, 79, 65, 62], 
            "City" => ["New York", "London", "Paris", "New York", "Madrid", "Paris"])
df = DataFrame(data)

6×5 DataFrame
 Row │ Age    City      Height  Name     Weight
     │ Int64  String    Int64   String   Int64
─────┼──────────────────────────────────────────
   1 │    20  New York     175  Alice        72
   2 │    30  London       188  Bob          80
   3 │    25  Paris        182  Charlie      85
   4 │    19  New York     192  David        79
   5 │    30  Madrid       172  Emma         65
   6 │    28  Paris        168  Fiona        62

a) Access row 2, column "Age"

In [66]:
age_of_bob = df[2, :Age]

30

b) Extract the column "City" as a 6-element Vector and as a 6x1 DataFrame

In [69]:
# city_column = df[:, :City]
city_column = df[:, [:City]]

6×1 DataFrame
 Row │ City
     │ String
─────┼──────────
   1 │ New York
   2 │ London
   3 │ Paris
   4 │ New York
   5 │ Madrid
   6 │ Paris

c) Return a copy of data frame using [`subset`](https://dataframes.juliadata.org/stable/lib/functions/#DataFrames.subset) under the condition that the age of the person is greater than 20.

In [71]:
subset(df, :Age => ByRow(x -> x>20))

4×6 DataFrame
 Row │ Age    City    Height  Name     Weight  BMI
     │ Int64  String  Int64   String   Int64   Float64
─────┼─────────────────────────────────────────────────
   1 │    30  London     188  Bob          80  22.6347
   2 │    25  Paris      182  Charlie      85  25.6612
   3 │    30  Madrid     172  Emma         65  21.9713
   4 │    28  Paris      168  Fiona        62  21.9671

d) Calculate the average height of all persons. 

Hint: The functions `mean` is available in the `Statistics` package.

In [72]:
mean(df[!, :Height])

179.5

e) Calculate the average age of the people in the different cities.

Hint: Use [`groupby`](https://dataframes.juliadata.org/stable/lib/functions/#DataFrames.groupby) and [`combine`](https://dataframes.juliadata.org/stable/lib/functions/#DataFrames.combine). Check out the [Grouping data and aggregation]((https://dataframes.juliadata.org/stable/man/comparisons/#Grouping-data-and-aggregation)) section of the DataFrames.jl webpage.

In [74]:
# groupby(df, :City)
combine(groupby(df, :City), :Age => mean)

4×2 DataFrame
 Row │ City      Age_mean
     │ String    Float64
─────┼────────────────────
   1 │ New York      19.5
   2 │ London        30.0
   3 │ Paris         26.5
   4 │ Madrid        30.0

f) Add a new column with the [body mass index](https://en.wikipedia.org/wiki/Body_mass_index) of each person.

In [65]:
# transform!(df, [:Height, :Weight] => ByRow((h, w) -> w / (h/100.)^2) => :BMI)
transform!(df, [:Height, :Weight] => ((h, w) -> w ./ (h./100.).^2) => :BMI)

6×6 DataFrame
 Row │ Age    City      Height  Name     Weight  BMI
     │ Int64  String    Int64   String   Int64   Float64
─────┼───────────────────────────────────────────────────
   1 │    20  New York     175  Alice        72  23.5102
   2 │    30  London       188  Bob          80  22.6347
   3 │    25  Paris        182  Charlie      85  25.6612
   4 │    19  New York     192  David        79  21.4301
   5 │    30  Madrid       172  Emma         65  21.9713
   6 │    28  Paris        168  Fiona        62  21.9671

g) Modify the dataframe so that all city names are given in uppercase letters.

In [33]:
df.City = uppercase.(df.City)
df

6×6 DataFrame
 Row │ Age    City      Height  Name     Weight  BMI
     │ Int64  String    Int64   String   Int64   Float64
─────┼───────────────────────────────────────────────────
   1 │    20  NEW YORK     175  Alice        72  23.5102
   2 │    30  LONDON       188  Bob          80  22.6347
   3 │    25  PARIS        182  Charlie      85  25.6612
   4 │    19  NEW YORK     192  David        79  21.4301
   5 │    30  MADRID       172  Emma         65  21.9713
   6 │    28  PARIS        168  Fiona        62  21.9671

h) Sort the data according to the BMI value

In [36]:
sort!(df, :BMI)

6×6 DataFrame
 Row │ Age    City      Height  Name     Weight  BMI
     │ Int64  String    Int64   String   Int64   Float64
─────┼───────────────────────────────────────────────────
   1 │    19  NEW YORK     192  David        79  21.4301
   2 │    28  PARIS        168  Fiona        62  21.9671
   3 │    30  MADRID       172  Emma         65  21.9713
   4 │    30  LONDON       188  Bob          80  22.6347
   5 │    20  NEW YORK     175  Alice        72  23.5102
   6 │    25  PARIS        182  Charlie      85  25.6612

i) Create a new dataframe `df_new` where the Age, Weight, and BMI columns are removed.

In [75]:
df_new = select(df, Not([:Age, :Height, :Weight]))

6×3 DataFrame
 Row │ City      Name     BMI
     │ String    String   Float64
─────┼────────────────────────────
   1 │ New York  Alice    23.5102
   2 │ London    Bob      22.6347
   3 │ Paris     Charlie  25.6612
   4 │ New York  David    21.4301
   5 │ Madrid    Emma     21.9713
   6 │ Paris     Fiona    21.9671

#### Problem 2

Books are identified by an ID in a library. We have a data frame with book titles and a data frame with book prices.

In [48]:
using DataFrames

# Create two example DataFrames
df1 = DataFrame(Book_ID = [1, 2, 3, 4],
                Title = ["The Great Gatsby", "To Kill a Mockingbird", "1984", "The Catcher in the Rye"])

df2 = DataFrame(Book_ID = [2, 3, 5, 6],
                Price = [15.99, 12.50, 10.75, 20.00])

4×2 DataFrame
 Row │ Book_ID  Price
     │ Int64    Float64
─────┼──────────────────
   1 │       2    15.99
   2 │       3    12.5
   3 │       5    10.75
   4 │       6    20.0

a) Create a new table with the columns *Title* and *Price* which contains those books where both the title and the price are known. 

Hint: check out the [Introduction to joins](https://dataframes.juliadata.org/stable/man/joins/)

In [52]:
# your code here

# Perform inner join on the 'Book_ID' column
result = innerjoin(df1, df2, on=:Book_ID)

2×3 DataFrame
 Row │ Book_ID  Title                  Price
     │ Int64    String                 Float64
─────┼─────────────────────────────────────────
   1 │       2  To Kill a Mockingbird    15.99
   2 │       3  1984                     12.5

b) Create a new table with the columns *Title* and *Price* for all books. If the *Title* or *Price* is not known the table should have the entry *missing*.

In [53]:
result = outerjoin(df1, df2, on=:Book_ID)

6×3 DataFrame
 Row │ Book_ID  Title                   Price
     │ Int64    String?                 Float64?
─────┼─────────────────────────────────────────────
   1 │       2  To Kill a Mockingbird        15.99
   2 │       3  1984                         12.5
   3 │       1  The Great Gatsby        missing
   4 │       4  The Catcher in the Rye  missing
   5 │       5  missing                      10.75
   6 │       6  missing                      20.0